app/views/scores/show_by_genre.html.erb

			<td><%= s.user_id %></td>
			<td><%= User.find_by(id: s.user_id).name %></td>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]