app/views/scores/show_by_subgenre.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
			<td><%= s.user_id %></td>
			<td><%= User.find_by(id: s.user_id).name %></td>