app/controllers/genres_controller.rb

	def show
		@genre = Genre.find(params[:id])
---
SELECT "sub_genres".* FROM "sub_genres" WHERE "sub_genres"."genre_id" = ?  [["genre_id", 1]]