app/controllers/questions_controller.rb

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "scores".* FROM "scores" WHERE "scores"."quiz_id" = ? AND "scores"."user_id" = ? LIMIT ?  [["quiz_id", 1], ["user_id", 2], ["LIMIT", 1]]
SELECT  "questions".* FROM "questions" WHERE "questions"."quiz_id" = ? AND "questions"."order" = ? ORDER BY "questions"."id" ASC LIMIT ?  [["quiz_id", 2], ["order", 2], ["LIMIT", 1]]
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = ?  [["question_id", 4]]
UPDATE "scores" SET "score" = ?, "updated_at" = ? WHERE "scores"."id" = ?  [["score", 0], ["updated_at", "2017-09-20 10:05:13.078576"], ["id", 1]]
---
	def show
		@question = Question.find(params[:id])
		@answers = @question.answers
		@quiz_id = @question.quiz_id

		current_quiz = Quiz.find_by_id(@quiz_id).id
		current_user_id = session[:user_id]
		@current_score = Score.find_by(quiz_id: current_quiz, user_id: current_user_id)

		if @question.order == 1 #FIRST QUESTION
			@current_score.update(score: 0)

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = ?  [["question_id", 1]]
SELECT  "scores".* FROM "scores" WHERE "scores"."quiz_id" = 1 AND "scores"."user_id" = ? LIMIT ?  [["user_id", 2], ["LIMIT", 1]]
---
	def submit #Checking if answer is correct
		@question = Question.find(params[:id])
		@answers = @question.answers

		@is_answer_correct = 1 #Assume Answer is correct

		@answers.each do |ans|
			puts ans.correct

			symbol = ("a" + ans.id.to_s).to_sym
			puts params[symbol]
			if ans.correct == true && params[symbol] != '1'
				@is_answer_correct = 0 #Answer for question is NOT correct
				break
			elsif ans.correct == false && params[symbol] == '1'
				@is_answer_correct = 0 #Answer for question is NOT correct
				break
			end
		end

		@quiz_id = @question.quiz_id

		current_quiz = Quiz.find_by_id(@quiz_id)
		current_user_id = session[:user_id]
		@current_score = Score.find_by(quiz_id: current_quiz, user_id: current_user_id)

UPDATE "scores" SET "score" = ?, "updated_at" = ? WHERE "scores"."id" = ?  [["score", 10], ["updated_at", "2017-09-20 09:52:09.018511"], ["id", 1]]
---
		if @is_answer_correct==1
			puts "**************CORRECT ANSWER****************"
			score = score + 10
			@current_score.update(score: score)

SELECT  "questions".* FROM "questions" WHERE "questions"."quiz_id" = ? AND "questions"."order" = ? ORDER BY "questions"."id" ASC LIMIT ?  [["quiz_id", 1], ["order", 3], ["LIMIT", 1]]
---
		@last_question = 0


		if current_order >= Question.where(quiz_id: @quiz_id).last.order