app/controllers/quizzes_controller.rb

	def show
		@quiz = Quiz.find(params[:id])
		@questions = @quiz.questions

		@score = Score.find_by(quiz_id: @quiz.id, user_id: session[:user_id])

		if @score
			puts "SCORE!!!!!!"
			puts @score
		else
		@score = Score.new(quiz_id: @quiz.id, user_id: session[:user_id], score: 0)
		@score.save
---
SELECT  "questions".* FROM "questions" WHERE "questions"."quiz_id" = ? ORDER BY "questions"."id" ASC LIMIT ?  [["quiz_id", 1], ["LIMIT", 1]]
SELECT  "scores".* FROM "scores" WHERE "scores"."quiz_id" = ? AND "scores"."user_id" = ? LIMIT ?  [["quiz_id", 1], ["user_id", 2], ["LIMIT", 1]]
INSERT INTO "scores" ("score", "quiz_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["score", 0], ["quiz_id", 1], ["user_id", 1], ["created_at", "2017-09-19 21:45:34.436848"], ["updated_at", "2017-09-19 21:45:34.436848"]]