app/controllers/scores_controller.rb

	def show_by_genre
		@genre = Genre.find_by(params[:id])

		@sub_genres = @genre.sub_genres
		@quizzes = @sub_genres.first.quizzes

		quiz_id_array = []
		@quizzes.each do |q|
			quiz_id_array << q.id
		end

		@scores = Score.where(quiz_id: quiz_id_array.first) #NOT CORRECT
---
SELECT  "sub_genres".* FROM "sub_genres" WHERE "sub_genres"."genre_id" = ? ORDER BY "sub_genres"."id" ASC LIMIT ?  [["genre_id", 1], ["LIMIT", 1]]
SELECT  "sub_genres".* FROM "sub_genres" WHERE "sub_genres"."genre_id" = ? LIMIT ?  [["genre_id", 1], ["LIMIT", 11]]
SELECT "quizzes".* FROM "quizzes" WHERE "quizzes"."sub_genre_id" = ?  [["sub_genre_id", 1]]
SELECT  "scores".* FROM "scores" WHERE "scores"."quiz_id" = ? LIMIT ?  [["quiz_id", 1], ["LIMIT", 1]]

	def show_by_subgenre
		@sub_genre = SubGenre.find_by(params[:id])
		@quizzes = @sub_genre.quizzes

		quiz_id_array = []
		@quizzes.each do |q|
			quiz_id_array << q.id
		end

		@scores = Score.where(quiz_id: quiz_id_array.first) #NOT CORRECT
---
SELECT  "sub_genres".* FROM "sub_genres" WHERE (1) LIMIT ?  [["LIMIT", 1]]
SELECT "quizzes".* FROM "quizzes" WHERE "quizzes"."sub_genre_id" = ?  [["sub_genre_id", 1]]
SELECT "scores".* FROM "scores" WHERE "scores"."quiz_id" = ?  [["quiz_id", 1]]