app/controllers/sub_genres_controller.rb

SELECT  "sub_genres".* FROM "sub_genres" WHERE "sub_genres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def show
		@sub_genre = SubGenre.find(params[:id])