app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "email" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "hello"], ["email", "1@1.com"], ["password_digest", "$2a$10$csXW3pLD2GvW/Cd6Y2dj9On1AI5g2dyvQ6ljX9t9tS5ac9bZVdrRW"], ["updated_at", "2017-09-19 17:16:41.037152"], ["id", 1]]
---
  def update
  	@user = User.find(params[:id])

    respond_to do |format|
      if @user.update(user_params)